# -*- coding: utf-8 -*-

FESTIVAL = {
    '01.01': '元旦节',
    '02.14': '情人节',
    '05.01': '劳动节',
    '05.04': '青年节',
    '06.01': '儿童节',
    '09.10': '教师节',
    '10.01': '国庆节',
    '12.25': '圣诞节',
    '03.08': '妇女节',
    '03.12': '植树节',
    '04.01': '愚人节',
    '05.12': '护士节',
    '07.01': '建党节',
    '08.01': '建军节',
    '12.24': '平安夜',
}

FESTIVAL_LUNAR = {
    '正月初一': '春节',
    '正月十五': '元宵节',
    '二月初二': '龙抬头',
    '五月初五': '端午节',
    '七月初七': '七夕节',
    '七月十五': '中元节',
    '八月十五': '中秋节',
    '九月初九': '重阳节',
    '十月初一': '寒衣节',
    '十月十五': '下元节',
    '腊月初八': '腊八节',
    '腊月廿三': '北方小年',
    '腊月廿四': '南方小年',
    '腊月末': '除夕'
}